/*
написать программу, которая создаст массив из 20 случайных целых чисел 
и выведет среднее арифметическое значение для этого массива

*/

/*
#include <iostream>


int main()
{

    //тип имя[размер]
    //переменные помеченные const не могут изменяться
    //должны быть сразу инициализированы
    //название пишется большими буквами
    //Размер массива должен быть целым числом или целочисленной константой
   
    
    //srand(time(NULL));
    //size_t const SIZE = 15;
    //int arr[SIZE];
    //int start;
    //int end;
    //std::cin >> start >> end;
    ////заполнение массива случайными числами
    //for (size_t i = 0; i < SIZE; i++)
    //{
    //    arr[i] = rand() % (end - start) + start;
    //}
    ////вывод массива
    //for (size_t i=0; i < SIZE; i++)
    //{
    //    std::cout << arr[i] << " ";
    //}
    ////минимум и максимум (линейный поиск)
    //int max = arr[0];
    //int min = arr[0];
    //for (size_t i = 1; i < SIZE; i++)
    //{
    //    if (arr[i] > max)
    //    {
    //        max = arr[i];
    //    }
    //    else if (arr[i] < min)
    //    {
    //        min = arr[i];
    //    }
    //}
    //std::cout << "\n" << max << " " << min;
    //setlocale(LC_ALL, "ru");
    //std::cout << "Введите число\n";
    //int find_number;
    //std::cin >> find_number;
    ////contains - содержится ли число
    //bool is_contains = false;
    //for (size_t i = 0; i < SIZE; i++)
    //{
    //    if (arr[i] == find_number)
    //    {
    //        is_contains = true;
    //        break;
    //    }
    //}
    //std::cout << (is_contains ? "число найдено": "число не найдено") << std::endl;
    ////find - найти индекс первого вхождения элмента
    //int index = -1;
    //for (size_t i = 0; i < SIZE; i++)
    //{
    //    if (arr[i] == find_number)
    //    {
    //        index = i;
    //        break;
    //    }
    //}
    //std::cout << index << std::endl;
    ////rfind - найтие индекс последнего вхождения
    //int rindex = -1;
    //for (size_t i = SIZE - 1; i >= 0; i--)
    //{
    //    if (arr[i] == find_number)
    //    {
    //        rindex = i;
    //        break;
    //    }
    //}
    //std::cout << rindex;
    setlocale(LC_ALL, "ru");
    size_t const SIZE = 50;
    char str[SIZE] = "привет";
    std::cout << (str[6] == '\0');
}
*/
