//#include<iostream>
//#include<ctime>
//using namespace std;
//
//int KUB(int R,int Y)
//{
//	if (R == 5)
//		cout << " 0---------0" << '\n' << " |    0    |" << '\n' << " 0---------0 ";
//	if (R == 6)
//		cout << " 0----0----0 " << '\n' << " |         |" << '\n' << " 0----0----0 ";
//	if (R == 4)
//		cout << " 0---------0 " << '\n' << " |         |" << '\n' << " 0---------0 ";
//	if (R == 3)
//		cout << " 0---------- " << '\n' << " |    0    |" << '\n' <<  " ----------0 ";
//	if (R == 2)
//		cout << " 0---------- " << '\n' << " |         |" << '\n' <<  " ----------0 ";
//	if (R == 1)
//		cout << " ----------- " << '\n' << " |    0    |" << '\n' <<  " -----------";
//
//	cout << '\n'<<'\n';
//	if (Y == 5)
//		cout << " 0---------0" << '\n' << " |    0    |" << '\n' << " 0---------0 ";
//	if (Y == 6)
//		cout << " 0----0----0 " << '\n' << " |         |" << '\n' << " 0----0----0 ";
//	if (Y == 4)
//		cout << " 0---------0 " << '\n' << " |         |" << '\n' << " 0---------0 ";
//	if (Y == 3)
//		cout << " 0---------- " << '\n' << " |    0    |" << '\n' << " ----------0 ";
//	if (Y == 2)
//		cout << " 0---------- " << '\n' << " |         |" << '\n' << " ----------0 ";
//	if (Y == 1)
//		cout << " ----------- " << '\n' << " |    0    |" << '\n' << " -----------";
//
//
//
//	return R+Y;
//
//}
//
//
//
//int main()
//{
//	setlocale(LC_ALL, "ru");
//	int summ2 = 0;
//	int summ1 = 0;
//
//	//cout << "хотите бросать первым ?  да -1 /нет- 0 ";
//
//	for (int i = 1; i < 6; i++)
//	{ 
//		int a;
//		cout << "делаем бросок "<< i <<" ?" <<'\n'<< "да - 1 / нет - 0 "<<'\n';
//		cin >> a ;
//		cout << '\n';
//		if (a == 1)
//		{
//			system("cls");
//			cout << "бросок N " << i << '\n' << '\n';
//			srand(time(NULL));
//
//			int R = rand() % 6 + 1;
//			int Y = rand() % 6 + 1;
//			KUB(R, Y);
//			summ1 = summ1 + R + Y;
//			cout << '\n' << "сумма ваших выпавших чисел в этом броске  " << R + Y << '\n';
//			//cout << "сумма всех чисел включая предыдущие броски -" << summ1 << '\n';
//			
//			int O = rand() % 6 + 1;
//			int U = rand() % 6 + 1;
//			KUB(O, U);
//			summ2 = summ2 + O + U;
//			cout << '\n' << "сумма  выпавших  чисел комьютера в это броске " << O + U << '\n'<<'\n';
//			//cout << "сумма всех чисел включая предыдущие броски -" << summ2 << '\n' << '\n';
//			
//			if (i == 5  )
//			{
//				cout << "сумма всех выпавших чисел игрока включая предыдущие броски  " << summ1 << '\n';
//				cout << "сумма всех выпавших чисел компьютера включая предыдущие броски  " << summ2 << '\n' << '\n';
//
//				cout << (summ1 > summ2 ? "вы выиграли  " : "выиграл компьютер ")<<'\n';
//			}
//			
//		}
//
//	}
//
//}