//—оздайте класс `Book`.
//“ребовани€:
//-ѕол€ : `title` (название, строка), `author` (автор, строка),
// `year` (год издани€, int), `pages` (количество страниц, int).
//-  онструктор по умолчанию(инициализирует пустыми значени€ми и нул€ми).
//-  онструктор с параметрами(название, автор, год, страницы).
//-  онструктор копировани€.
//- ƒеструктор(выводит сообщение о том, что книга уничтожена, с указанием названи€).
//- ћетоды:
//`bool isAntique()` - возвращает true, если книга издана раньше 1900 года.
//`void print()` - выводит информацию о книге.
